# 1)Создайте список из случайных чисел. 
# Найдите максимальное количество его одинаковых элементов.
a = [1,2,3,1]
for i in range(len(a)):
    print(max(a[i]))

